# Queries

Use this notebook for querying the data base. Currently, no more than 5 queries in a session are allowed, however you can write a more complex SQL query if necessary.

In [ ]:
#!pip install psycopg2
import psycopg2
import sqlite3
import io
from sqlalchemy import create_engine
import gspread # To link to google sheets
import pandas as pd
import numpy as np

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

The following establishes the connection to the database

In [ ]:
conn = psycopg2.connect("host=  dbname=hsrbrmdw user= password= ")
cur = conn.cursor()

The following queries the database and lists the avaialble tables

In [ ]:
cur.execute('SELECT * FROM catch.annual;') #write SQL query in brackets
data = cur.fetchall()
df = pd.DataFrame(data) # Need to add headers after this call. So need to document this in Manual
df #This is a data frame you can writexl to write to Excel file

           0         1        2        3   ...       10       11       12       13
0  2008-01-01   8.34394      NaN      NaN  ...      NaN      NaN      NaN      NaN
1  2009-01-01  10.45040      NaN      NaN  ...      NaN      NaN      NaN      NaN
2  2010-01-01   8.51185      NaN      NaN  ...      NaN      NaN      NaN      NaN
3  2011-01-01   8.51363      NaN  66.6600  ...      NaN      NaN  22.8100      NaN
4  2012-01-01   9.62214      NaN  68.5400  ...      NaN      NaN  23.8500      NaN
5  2013-01-01   5.45849  25.6588  67.5900  ...  26.5578  17.8851  20.8761  23.4791
6  2014-01-01  10.27440  26.1761  68.1000  ...  27.2565  18.3196  22.3707  24.2333
7  2015-01-01   9.97953  25.1049  61.8500  ...  26.5833  17.7474  26.0770  23.9704
8  2016-01-01  10.64620  25.1329  62.7566  ...  26.6218  17.7487  22.8539  23.9808
9  2017-01-01       NaN      NaN  53.1900  ...      NaN      NaN  19.5300      NaN

[10 rows x 14 columns]

The following downloads the results of the database query as an Excel file to your downloads folder on your local drive.

In [ ]:
db = df.to_excel('db.xlsx', sheet_name='sheet1', index=False)
from google.colab import files
files.download('db.xlsx')